MIPRO/mda-thesis.html
<!doctype html>
<html lang="en">
<head>
<title>Model Driven Architecture Based on Linked Data</title>
<!-- 2018-01-08 Mon 11:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Cherkashin Evgeny, Alexey Kopaigorodsky, Ljubica Kazi, ...">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Model Driven Architecture Based on Linked Data</h1>
<p>
We consider tools for developing information systems with extensive use of Linked Open Data technologies [<a href="#Bizer">1</a>].  The LOD technologies allows software designers to develop program systems data integrated by means of common ontologies and web protocols [<a href="#Cherk">2</a>].  An application of semantic models at run time [<a href="#Kopay">3</a>] allowed software designers to partially cope with problem of requirements and data structure evolution in lifespan of information systems.  A part of system configuration (static or dynamic) is build on domain ontology model interpretation, thus modifying information system behavior, resulting in a wider flexibility of system functioning.
</p>

<p>
The present research deals with developing a software instrumental tools for general design of information systems using both Model Driven Architecture (MDA) and LOD [<a href="#MDA">4</a>].  MDA Platform Independent Model (PIM) is expressed as set of UML diagrams (Class Diagram, State Diagram, <i>etc.</i>).  The model form a <code>namespace</code> of a LOD graph.  All the PIM entities (MOF structures) are defined as ontology resources, <i>i.e.</i> with URI references to LOD terms.  This allows us to translate PIM UML model to set of triples and store them in an ontology warehouse for further transformation into a Platform Specific Model (PSM).
</p>

<p>
The <code>ClipPatria</code> ontology server and the SWI Prolog language [<a href="#Clio">5</a>] is used as tools of MDA model querying and processing.
</p>

<p>
One of the problem of tools construction of such kind is the absence of visual editors of UML supporting ontology models.  The UML 2.4 standard implicitly suggests coupling stereotypes and tag values forming a data format representing the stereotype aspect of the UML entities.  Thus, one of the research direction is to construct new or adapt existing UML modeling tool to support LOD in UML diagrams.
</p>

<p>
The tools will allow us to join the MDA static means of code generation and configuration at development stage with the techniques of flexible data structure processing at run time, thus, producing even more productive information system development and maintenance.
</p>


<p>
<b>References</b>
</p>
<ol class="org-ol">
<li><a id="Bizer" name="Bizer"></a> Ch. Bizer, T. Heath, T. Berners-Lee. Linked Data – The Story So Far // International Journal on Semantic Web and Information Systems. 2009. Vol. 5 (3). pp. 1–22.
</li>
<li><a id="Cherk" name="Cherk"></a> E. Cherkashin, I. Orlova. Instrumental tools for construction of the digital archives of the documents based on Linked Data. Modern technologies, System analysis, Modeling. 4(56) 2017 pp. 100-107 (in Russian) <code>DOI:</code> <a href="10.26731/1813-9108.2017.4(56).100-107">10.26731/1813-9108.2017.4(56).100-107</a>, <code>URL:</code> <a href="http://stsam.irgups.ru/sites/default/files/articles_pdf_files/100-107.pdf">http://stsam.irgups.ru/sites/default/files/articles_pdf_files/100-107.pdf</a>
</li>
<li><a id="Kopay" name="Kopay"></a> N. Kopaigorodsky. Use of ontologies in semantic information systems. // Journal "Ontology of Design", 4(14), 2014, p. 78&#x2013;89 (in Russian) <code>URL:</code> <a href="http://agora.guru.ru/scientific_journal/files/Ontology_Of_Designing_4_2014_opt1.pdf">http://agora.guru.ru/scientific_journal/files/Ontology_Of_Designing_4_2014_opt1.pdf</a>
</li>
<li><a id="MDA" name="MDA"></a> D. Frankel. Model Driven Architecture: Applying MDA to Enterprise Computing. Wiley; 1 edition, 2003, 352 p.
</li>
<li><a id="Clio" name="Clio"></a> J. Wielemaker, W. Beek, M. Hildebrand, J. Ossenbruggen. ClioPatria: A SWI-Prolog Infrastructure for the Semantic Web. Semantic Web, vol. 7, no. 5, 2016, pp. 529-541. <code>DOI:</code> <a href="10.3233/SW-150191">10.3233/SW-150191</a>
</li>
</ol>

<p>
<b>Appendix</b>
</p>

<ol class="org-ol">
<li>Org mode fantastic examples: <a href="http://ehneilsen.net/notebook/orgExamples/org-examples.html">http://ehneilsen.net/notebook/orgExamples/org-examples.html</a>.
</li>
<li>ODM UML profile for OWL: <a href="http://www.omg.org/spec/ODM/1.0/PDF/">http://www.omg.org/spec/ODM/1.0/PDF/</a>.
</li>
<li>OMG Ontology Domain Modeling example: <a href="https://thematix.com/tools/vom/">https://thematix.com/tools/vom/</a>.
</li>
<li>OWL UML Visualizer: <a href="http://owlgred.lumii.lv/">http://owlgred.lumii.lv/</a>.
</li>
<li>UMLtoOWL: Converter from UML to OWL: <a href="http://www.sfu.ca/~dgasevic/projects/UMLtoOWL/">http://www.sfu.ca/~dgasevic/projects/UMLtoOWL/</a>. Uses XSLT to convert from XMI to OWL.
</li>
<li>Book: Model Driven Engineering and Ontology Development. Authors: Dragan Gaševic,Dragan Djuric,Vladan Devedžic: <a href="http://www.springer.com/gp/book/9783642002816">http://www.springer.com/gp/book/9783642002816</a> 2009.
</li>
<li>AToM3: A tool for multi-paradigm modeling. <a href="http://atom3.cs.mcgill.ca/">http://atom3.cs.mcgill.ca/</a>.
</li>
<li>Belghiat, Aissam &amp; Bourahla, Mustapha. (2012). UML Class Diagrams to OWL Ontologies: A Graph Transformation based Approach. International Journal of Computer Applications. 41. 41-46. 10.5120/5525-7566.
</li>
<li><b>Semantic WEB Software Engineering</b>: <a href="http://www.webist.org/Documents/Previous_Invited_Speakers/2012/WEBIST2012_Pan.pdf">http://www.webist.org/Documents/Previous_Invited_Speakers/2012/WEBIST2012_Pan.pdf</a>. Book: <a href="https://www.iospress.nl/book/semantic-web-enabled-software-engineering/">https://www.iospress.nl/book/semantic-web-enabled-software-engineering/</a>.
</li>
</ol>
</div><div class="col-md-3"></div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Cherkashin Evgeny, Alexey Kopaigorodsky, Ljubica Kazi, &#x2026;</p>
<p class="date">Created: 2018-01-08 Mon 11:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
